Revit 2024 API
IPerformanceAdviserRule.GetDescription Method
 Retrieves the description of the rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
string GetDescription()
Visual Basic
Function GetDescription As String
Visual C++
String^ GetDescription()
Return Value
 The description of the rule.
Remarks
 Method should return a brief (one-two sentences) description of the rule. String should be localized.
See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace